[
{"title": "Automated code translation", "url": "https://upcommons.upc.edu/handle/2117/394840", "author": "Cano Cañardo, David", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Restricted access - confidentiality agreement", "abstract": "L'objectiu general d'aquest treball és realitzar un estudi sobre com poder migrar, de manera eficient, codis escrits en Java cap a Kotlin. S'han valorat les opcions que es tenen avui en dia i s'ha plantejat una nova solució, ..."},
{"title": "Dashboard per un estudi de les malalties NTDs", "url": "https://upcommons.upc.edu/handle/2117/394839", "author": "Herrera Caba, Júlia", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "Com poder visualitzar de forma ràpida i senzilla el seguiment d'un projecte? L'equip del DTIM de la UPC està desenvolupant un projecte que a partir d'imatges de microscopi i intel·ligència artificial diagnostica de forma ..."},
{"title": "Integration of social values in a multi-agent platform running in a supercomputer", "url": "https://upcommons.upc.edu/handle/2117/394838", "author": "Bolea Pérez, David", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "Agent-based modelling is one of the most suitable ways to simulate and analyse complex\r\nproblems and scenarios, especially those involving social interactions. Multi-agent systems, consisting\r\nof multiple agents in a ..."},
{"title": "Desenvolupament de l'aplicació Corre-Fulles per incentivar l'interès per la flora de zones verdes", "url": "https://upcommons.upc.edu/handle/2117/394837", "author": "Garrapucho Lévy, Daniel", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "El document explica el desenvolupament d'un projecte de Treball Final de Grau, al Grau en Enginyeria Informàtica de la Universitat Politècnica de Catalunya. El projecte era, principalment, el desenvolupament d'una aplicació ..."},
{"title": "A Radial Basis Function Neural Network using biologically plausible activation functions", "url": "https://upcommons.upc.edu/handle/2117/394825", "author": "Tarrés Ribalta, Albert", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "Este proyecto se centra en el diseño, la implementación y la evaluación de Redes Neuronales de Función de Base Radial (RBFNN), comparando el modelo gaussiano con una nueva versión que utiliza la función de activación Ricker. ..."},
{"title": "IMP-BLAST : Desenvolupament i Integració d'un Traductor Bidireccional entre SQL i Lògica de Primer Ordre", "url": "https://upcommons.upc.edu/handle/2117/394824", "author": "Juanola Ametller, Martí", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "SQL és el principal llenguatge utilitzat per consultar i interactuar amb dades de bases de dades relacionals. Tot i això, SQL no permet raonar sobre les consultes tal com es pot fer des del càlcul relacional, que permet ..."},
{"title": "Systematic Literature Review Support (GESSI-SLR)", "url": "https://upcommons.upc.edu/handle/2117/394823", "author": "Aumatell Grabolosa, Adrià", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "GESSI-SLR és una web app impulsada pel grup d'investigació GESSI que té per objectiu agilitzar els SLR (Systematic Literature Reviews). L'objectiu d'aquest projecte era millorar aquesta aplicació afegint-hi noves funcionalitats. ..."},
{"title": "Traffic Analysis of Quantum Computing Algorithms Mapped in Multicore Architectures", "url": "https://upcommons.upc.edu/handle/2117/394822", "author": "López Agudo, Isaac", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "Els processadors quàntics multicores són possiblement la millor solució al problema de l'escalabilitat que afronta la Computació Quàntica més enllà de l'era NISQ. Basant-se en la interconnexió de petits xips formats per ..."},
{"title": "Clustering and visualization of Lithium-Ion battery data for second life applications", "url": "https://upcommons.upc.edu/handle/2117/394821", "author": "Domínguez Piernas, Gabriel", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "L'ús de bateries de segona vida és una de les estratègies més prometedores per a resoldre el problema del reciclatge de piles en el futur. L'objectiu d'aquesta recerca és aportar solucions pràctiques de garbellat, reagrupació ..."},
{"title": "Creación de una web común para los refugios de animales", "url": "https://upcommons.upc.edu/handle/2117/394808", "author": "Sanecki, Dawid Aleksander", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "El proyecto \"Creación de una web común para los refugios de animales\" es un proyecto del fin de grado de ingeniería informática, de la especialidad de la ingeniería del software, para la Facultad de Informática de Barcelona ..."},
{"title": "Desenvolupament d'Algoritmes de Machine Learning aplicats a la indústria", "url": "https://upcommons.upc.edu/handle/2117/394807", "author": "Fibla Figuerola, Ignasi", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Restricted access - confidentiality agreement", "abstract": "En aquesta memòria es presenten totes les anàlisis resultants del treball dut a terme en el meu treball final de grau en el marc de la col·laboració entre l'inLab FIB i KaptureIO, per millorar l'eficiència i la qualitat ..."},
{"title": "Desenvolupament d'un conjunt d'eines auxiliars per a un programari de gestió de laboratori", "url": "https://upcommons.upc.edu/handle/2117/394806", "author": "Fernández Clemente, Irene", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "Les empreses farmacèutiques empren una classe de software anomenada LIMS, o Laboratory Information Management System, per gestionar els procediments de laboratori que realitzen. Kymos, l'empresa on es realitza aquest ..."}
]